/*
var არის ძველი აღარ ხმარობენ რადგან var-ი არის function scope რაც ნიშნავს რომ ფუნქციაში
სადაც შეიქმნა ყველგან შეგიძლია რომ გამოიყენო და კიდე შეგიძლია რომ გაუკეთო redeclare ანუ (+ window ობიექტზე აკეთებს ზემოქმედებას)
შეგიძლია იგივე ცვლადი შექმნა თავიდან მაგ:

var x = 0
var x = 1

და ეს არ იქნება error

let არის უფრო ახალი და ხმარობენ რადგან ის არის block scope ეს ნიშნავს რომ რომელ {} ანუ block-ში
შეიქმნა მარტო მანდ შეგიძლია რომ გამოიყენო და სხვაგან თუ გამოიყენებ დაგიწერს რომ ცვლადი
არ გაქვს შექმნილი მაგ:

if (true) {
    let x = 0
}
console.log(x)

და აქ დაგიწერს რომ ცვლადი არ გაქვს შექმნილი

const (constant) არის ლათინური სიტყვა რომელიც ნიშნავს მუდმივს შესაბამისად ცვლადი რომელიც
შეიქმნება const-ით იქნება მუდმივი ანუ მის მნიშვნელობას ვეღარ შეცვლი

*/