/* increment / decrement increment-ს ვხმარობ როდესაც ჩვენ გვინდა რომ რიცხვს ერთი
მივუმატოდ ვხმარობთ for ლოოპებში და decrement-ით ჩვენ რიცხვს ერთს ვაკლებთ
*/

/* literal string-ი არის იგივე f string (python-ში) უბრალოდ სხვა სახელია და სხნარაირად
იწერება და გვეხმარება რომ გაგვიმარტივოს სხვადასხვა მონაცემთა ტიპები ერთ ტექსტში რომ ჩავსვათ
*/

/* შექმენით let ცვლადი და მიანიჭეთ მას რიცხვი. += ოპერატორის გამოყენებით გაზარდეთ
 ეს რიცხვი 10-ით და გამოიტანეთ კონსოლში.
*/

let num = 0
num += 10
console.log(num)

/* შექმენით var ცვლადი საწყისი მნიშვნელობით 5. გამოიყენეთ ++
 ოპერატორი ორჯერ და საბოლოო შედეგი გამოიტანეთ კონსოლში.
*/

var num1 = 5
num1++
console.log(num1)

/* Math ობიექტის გამოყენებით კონსოლში გამოიტანეთ რიცხვის
 დამრგვალებული მნიშვნელობა (მთელ რიცხვამდე).
*/

console.log(Math.floor(4.5))

/* შექმენით const ცვლადი და მიანიჭეთ მას რაიმე რიცხვი. 
შეეცადეთ მისი მნიშვნელობის შეცვლას და დააკვირდით შედეგს.
*/

// const num2 = 2
// num2 = 0

/* შექმენით ორი let ცვლადი და მათში შეინახეთ რაღაც რიცხვი. გამოიყენეთ *= ოპერატორი,
რომ პირველი რიცხვი გაამრავლოთ მეორეზე და გამოიტანეთ კონსოლში.
*/

let num3 = 2
let num4 = 5
num3 *= num4

console.log(num3)

/* შექმენით let ცვლადი და მასში შეინახეთ რიცხვი 20. გამოიყენეთ -- ოპერატორი ერთხელ
და გამოიტანეთ შედეგი კონსოლში.
*/

let num5 = 20
num5--

console.log(num5)

/* Math.random()-ის გამოყენებით შექმენით ცვლადი, სადაც შეინახავთ random რიცხვს 1-დან 50-მდე
და გამოიტანეთ კონსოლში.
*/

let num6 = Math.floor(Math.random() * 50)

console.log(num6)

/* შექმენით ცვლადები, რომელშიც შეინახავთ ინფორმაციას თქვენს შესახებ (მაგ: სახელი, გვარი, ასაკი, ჰობბი და ა.შ).
თქვენი დავალებაა literal string-ების გამოყენებით ააწყოთ ერთი დიდი წინადადება.
*/

let myname = "taso"

var myage = 13

const animal = "doge"

console.log(`hellou, my name is ${myname} i am ${myage} years old and i have a ${animal}!`)